[
  {
    "title": "Harry Potter Ep1",
    "subtitle": "Harry Potter and the Philosopher's Stone",
    "image_url": "https://blog.estantevirtual.com.br/wp-content/uploads/Capa-blog-HP.png",
    "detail": "Late one night, Albus Dumbledore and Minerva McGonagall, professors at Hogwarts School of Witchcraft and Wizardry, along with the school's groundskeeper, Rubeus Hagrid, deliver a recently orphaned infant named Harry Potter to his only remaining relatives, the Dursleys.\nTen years later, Harry is living a difficult life with the Dursleys. After inadvertently causing an incident during a family trip to London Zoo, Harry begins receiving unsolicited letters by owls. After he and the Dursleys flee to an island to avoid more letters, Hagrid re-appears and informs Harry that he is a wizard and has been accepted into Hogwarts against the Dursleys' wishes. After taking Harry to Diagon Alley to buy his supplies for Hogwarts and a pet owl named Hedwig as a birthday present, Hagrid informs him of his past: Harry's parents, James and Lily Potter, died due to a Killing Curse at the hands of the malevolent and powerful wizard Lord Voldemort. Harry, the only survivor in the chaos, thus becomes well-known in the wizarding world as \"The Boy Who Lived\".\nHarry enters King's Cross station to board a train to Hogwarts, and shortly after beginning his journey, he meets three other students: Ron Weasley, whom he quickly befriends; Hermione Granger, an intelligent witch born to non-magical Muggle parents; and Draco Malfoy, a boy from a wealthy wizarding family, with whom he immediately forms a rivalry. After arriving at school, the students assemble in the Great Hall, where all the first-years are sorted by the Sorting Hat among four houses: Gryffindor, Hufflepuff, Ravenclaw, and Slytherin. Although the Sorting Hat considers putting Harry in Slytherin with Draco, he is placed into Gryffindor alongside Ron and Hermione.\nAt Hogwarts, Harry begins learning magic spells and discovers more about his past and parents. After recovering the Remembrall of Gryffindor student Neville Longbottom, Harry is recruited for Gryffindor's Quidditch team as a Seeker, an extraordinarily rare feat for first year students. On their way to the dorms one night, the staircases change paths, leading Harry, Ron, and Hermione to the forbidden floor of Hogwarts. The three discover a giant three-headed dog named Fluffy in a restricted area of the school. Ron then insults Hermione after being embarrassed by her in a Charms lesson, causing Hermione to lock herself in the girls' bathroom. She is attacked by a marauding troll, but Harry and Ron save her, befriending her in the process.\nThe children later find out that Fluffy is guarding the philosopher's stone, an object that has the power to turn any metal into gold and produce a potion that grants immortality. Harry suspects that the Potions teacher and head of Slytherin House Severus Snape is trying to obtain the stone in order to return Voldemort to physical form. Hagrid accidentally reveals to the trio that Fluffy will fall asleep if music is played to him. Harry, Ron, and Hermione decide that night to try and find the stone before Snape does. They discover an already-asleep Fluffy and face a series of safeguards, including a deadly plant known as Devil's Snare, a room filled with aggressive flying keys that bruise Harry, and a giant chess game that knocks out Ron.\nAfter getting past the tasks, Harry discovers that it was Defence Against the Dark Arts teacher Quirinus Quirrell who was trying to claim the stone: Snape had actually been protecting Harry all along. Quirrell removes his turban and reveals a weak Voldemort living on the back of his head. Through an enchantment placed by Dumbledore, Harry finds the stone in his possession. Voldemort attempts to bargain the stone from Harry in exchange for reviving his parents, but Harry refuses. Quirrell attempts to kill Harry in response; however, he is instead killed after Harry ends up burning his skin, reducing Quirrell to dust and causing Voldemort's soul to rise from his ashes. Harry is knocked unconscious when Voldemort's soul passes through him.\nHarry recovers in the school's hospital wing with Dumbledore at his side. Dumbledore explains that the stone has been destroyed and that Ron and Hermione are safe. Dumbledore also reveals how Harry was able to defeat Quirrell: When Harry's mother died to save him, her death gave Harry a love-based protection against Voldemort. Harry, Ron, and Hermione are rewarded with house points for their heroic performances, tying them for first place with Slytherin. Dumbledore then awards ten points to Neville for attempting to stop the trio, granting Gryffindor the House Cup. Harry returns home for the summer, happy to finally have a real home in Hogwarts."
  },
  {
    "title": "Harry Potter Ep2",
    "subtitle": "Harry Potter and the Chamber of Secrets",
    "image_url": "https://img-ha.mthcdn.com/a3K2ksVKj_ZII_h0zq2rOWxpKVs=/950x275/smart/mono29.com/app/wp-post-thumbnail/04Rhq1.jpg",
    "detail": "Spending the summer with the Dursleys, Harry Potter meets Dobby, a house-elf who warns him that it is too dangerous to return to Hogwarts. Dobby sabotages an important dinner for the Dursleys, who lock Harry up to prevent his return to Hogwarts. Harry's friend Ron Weasley and his brothers Fred and George rescue him in their father's flying Ford Anglia.\nHarry and the Weasley family are joined by Rubeus Hagrid and Hermione Granger at a book-signing by Gilderoy Lockhart, who later announces he is Hogwarts' new Defence Against the Dark Arts teacher. Confronted by Draco Malfoy, Harry notices Malfoy's father, Lucius, slip a book into Ginny Weasley's cauldron. When Harry and Ron are blocked from entering Platform Nine and Three-Quarters at London King's Cross railway station, they take the flying car to Hogwarts; after crashing into the Whomping Willow and breaking Ron's wand, they receive detention.\nIn detention, Harry hears strange voices and later finds caretaker Argus Filch's cat, Mrs. Norris, petrified beside a message written in blood: \"The Chamber of Secrets has been opened, enemies of the heir... beware.\" Professor McGonagall explains that one of Hogwarts' founders, Salazar Slytherin, supposedly constructed a secret Chamber containing a monster that only his Heir can control, capable of purging the school of Muggle-born students. Suspecting Malfoy is the Heir, Harry, Ron, and Hermione plan to question him while disguised using forbidden polyjuice potion, which they brew in a disused bathroom haunted by a ghost, Moaning Myrtle.\nDuring a Quidditch game, Harry's arm is broken by a Bludger. Visiting him in the infirmary, Dobby reveals that he closed the barrier to Platform 9 3/4 and made the Bludger chase Harry to force him to leave the school. He also reveals that the Chamber had been opened in the past. When Harry communicates with a snake, the school believes he is the Heir. Harry and Ron learn Malfoy is not the Heir, but his father had told him a Muggle-born girl died when the Chamber was last opened. Harry finds an enchanted diary owned by former student Tom Riddle, who fifty years prior accused Hagrid, then a student, of opening the Chamber. When the diary is stolen and Hermione is petrified, Harry and Ron question Hagrid. Professor Dumbledore, Minister of Magic Cornelius Fudge, and Lucius arrive to take Hagrid to Azkaban, but he discreetly tells the boys to \"follow the spiders\". In the Forbidden Forest, Harry and Ron meet Hagrid's giant pet spider, Aragog, who reveals Hagrid's innocence and provides a clue about the Chamber's monster.\nA book page in Hermione's hand identifies the monster as a Basilisk, a giant serpent that kills people who make direct eye contact with it; the petrified victims only saw it indirectly. The school staff learn Ginny has been taken into the Chamber, and nominate Lockhart to save her. Harry and Ron find Lockhart preparing to flee, exposing him as a fraud; deducing that Myrtle was the girl the Basilisk killed, they find the Chamber's entrance in the bathroom she haunts. Once inside, Lockhart seizes Ron's broken wand to try to escape but it backfires, wiping Lockhart's memory and causing a cave-in which separates Harry from Ron and Lockhart.\nHarry finds and enters the Chamber alone and finds Ginny unconscious, guarded by Riddle, who reveals that he used the diary to manipulate Ginny into reopening the Chamber, and that he is Slytherin's heir and Voldemort's younger self. After Harry expresses his loyalty to Dumbledore, Dumbledore's pet phoenix Fawkes arrives with the Sorting Hat, causing Riddle to summon the Basilisk. Fawkes blinds the Basilisk, and the Sorting Hat eventually produces the Sword of Gryffindor, with which Harry battles the Basilisk, killing it and getting poisoned by one of its fangs in the process.\nDespite his injury, Harry stabs the diary with the Basilisk fang, defeating Riddle and reviving Ginny. Fawkes' tears heal Harry, and he returns to Hogwarts with his friends and a baffled Lockhart, earning Dumbledore's praise and Hagrid's release. Harry accuses Lucius, Dobby's master, of planting the diary in Ginny's cauldron, and tricks him into freeing Dobby. The Basilisk's victims are healed, Hermione reunites with Harry and Ron, and Hagrid returns to Hogwarts."
  },
  {
    "title": "Harry Potter Ep3",
    "subtitle": "Harry Potter and the Prisoner of Azkaban",
    "image_url": "https://potterstoryweb.com/wp-content/uploads/2015/11/pt3.jpg",
    "detail": "Harry Potter has been spending another unhappy summer with the Dursleys. When Aunt Marge Dursley insults his parents, he loses his temper and accidentally causes her to inflate like a balloon and float away. Fed up, Harry then flees the Dursleys with his broom and trunk. The Knight Bus arrives and takes Harry to the Leaky Cauldron, where he is pardoned by Minister for Magic Cornelius Fudge for using magic outside of Hogwarts. After reuniting with his best friends Ron Weasley and Hermione Granger, Harry learns that Sirius Black, a convicted supporter of the dark wizard Lord Voldemort, has escaped Azkaban prison and intends to kill him.\nThe trio return to Hogwarts for the school year on the Hogwarts Express train, which is suddenly boarded by dementors, ghostly prison guards that are searching for Black. One enters the trio's compartment, causing Harry to pass out, but new Defence Against the Dark Arts teacher Remus Lupin repels the dementor with a Patronus Charm. At Hogwarts, headmaster Albus Dumbledore announces that dementors will be guarding the school until Black is captured. Hogwarts groundskeeper Rubeus Hagrid is announced as the new Care of Magical Creatures teacher; his first class goes badly when Draco Malfoy deliberately provokes the hippogriff Buckbeak, who then attacks him. Draco exaggerates his injury, and his father Lucius Malfoy later has Buckbeak sentenced to death.\nThe Fat Lady's portrait, which guards the Gryffindor rooms, is found ruined and empty. Terrified and hiding in another painting, she tells Dumbledore that Black has entered the castle. During a stormy Quidditch match against Hufflepuff, dementors attack Harry, causing him to fall off his broomstick which lands at the Whomping Willow, where it is destroyed. At Hogsmeade, Harry is shocked to learn that not only had Sirius been his father's best friend and apparently betrayed them to Voldemort, but is also Harry's godfather. Lupin privately teaches Harry to defend himself against dementors using the Patronus Charm.\nAfter Harry, Ron, and Hermione witness Buckbeak's apparent execution, Ron's pet rat Scabbers bites him and escapes. When Ron gives chase, a large dog appears and drags both Ron and Scabbers into a hole at the Whomping Willow's base. This leads the trio to an underground passage to the Shrieking Shack, where they discover that the dog is actually Sirius, who is an Animagus. Lupin arrives and embraces Sirius as an old friend. He admits to being a werewolf, and explains that Sirius is innocent. Sirius was falsely accused of betraying the Potters to Voldemort, as well as murdering twelve Muggles and their mutual friend, Peter Pettigrew. It is revealed that Scabbers is actually Pettigrew, an Animagus who betrayed the Potters and committed the murders.\nSeverus Snape arrives to apprehend Black but Harry knocks him unconscious with the Expelliarmus spell. After forcing Pettigrew back into human form, Lupin and Sirius prepare to kill him, but Harry convinces them to turn Pettigrew over to the dementors.\nAs the group departs, the full moon rises and Lupin transforms into a werewolf. Sirius transforms into his dog form to fight him off. In the midst of the chaos, Pettigrew transforms back into a rat and escapes. Harry and Sirius are attacked by dementors, and Harry sees a figure in the distance save them by casting a powerful Patronus spell. He believes the mysterious figure is his deceased father before passing out. He awakens to discover that Sirius has been captured and sentenced to the Dementor's Kiss.\nActing on Dumbledore's advice, Harry and Hermione travel back in time using Hermione's Time Turner, and watch themselves and Ron repeat the night's events. They save Buckbeak from execution and witness the Dementors overpower Harry and Sirius. The present Harry realises that it was actually himself who conjured the Patronus, and does so again. Harry and Hermione rescue Sirius, who escapes with Buckbeak. Exposed as a werewolf, Lupin resigns from teaching to prevent an uproar from parents. He also returns the Marauder's Map to Harry, as he no longer has the authority to confiscate contraband. Sirius sends Harry a Firebolt broom, and he happily takes it for a ride."
  },
  {
    "title": "Harry Potter Ep4",
    "subtitle": "Harry Potter and the Goblet of Fire",
    "image_url": "https://imgix.bustle.com/rehost/2016/9/13/aa2d5a63-4454-4d6a-bce5-b138f3b0ae08.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
    "detail": "Harry Potter awakens from a nightmare wherein a Muggle caretaker named Frank Bryce is killed after overhearing Lord Voldemort conspiring with Peter Pettigrew and another man. While Harry attends the Quidditch World Cup match between Ireland and Bulgaria with the Weasleys and Hermione, Death Eaters terrorise the camp, and the man who appeared in Harry's dream summons the Dark Mark.\nAt Hogwarts, Albus Dumbledore introduces ex-Auror Alastor \"Mad-Eye\" Moody as the new Defence Against the Dark Arts teacher. He also announces that the school will host the Triwizard Tournament, in which three magical schools compete across three challenges. Only wizards aged seventeen and above may compete. The Goblet of Fire selects \"champions\" to take part in the competition: Cedric Diggory of Hufflepuff representing Hogwarts, Viktor Krum representing the Durmstrang Institute from Eastern Europe, and Fleur Delacour representing the Beauxbatons Academy of Magic from France. The Goblet unexpectedly selects Harry as a fourth champion. Dumbledore is unable to pull the underage Harry out of the tournament, as Ministry official Barty Crouch Sr. insists the champions are bound by a contract after being selected.\nFor the first task, each champion must retrieve a golden egg guarded by a dragon. Harry succeeds in retrieving his egg, which contains information about the second challenge. On Christmas Eve, a formal dance event known as the Yule Ball takes place; Harry and Ron attend with Parvati and Padma Patil, Harry's crush Cho Chang attends with Cedric, and Hermione attends with Viktor, making Ron jealous.\nThe second task involves the champions diving underwater to rescue someone valuable to them. Harry finishes third, but is promoted to second behind Cedric due to his \"moral fibre\", after saving Fleur's sister Gabrielle as well as Ron. Afterwards, Harry discovers the corpse of Crouch Sr. in the forest. While waiting for Dumbledore in his office, Harry discovers a Pensieve, which holds Dumbledore's memories. Harry witnesses a trial in which Durmstrang headmaster and former Death Eater Igor Karkaroff confesses to the Ministry of Magic names of other Death Eaters after Voldemort's defeat. When he names Severus Snape, Dumbledore vouches for Snape's innocence; Snape turned spy against Voldemort before the latter's downfall. After Karkaroff names Barty Crouch Jr., a devastated Crouch Sr. imprisons his son in Azkaban. Exiting the Pensieve, Harry realizes that Crouch Jr. is the man he saw in his dream.\nFor the final task, the champions must reach the Triwizard Cup, located in a hedge maze. After Fleur and Viktor are incapacitated, Harry and Cedric reach the cup together. The two together grab the cup, which turns out to be a Portkey and transports them to a graveyard where Pettigrew and Voldemort are waiting. On Voldemort's orders, Pettigrew murders Cedric with the Killing Curse and performs a ritual that rejuvenates Voldemort, who then summons the Death Eaters. Voldemort releases Harry and challenges him to a duel to prove he is the better wizard. Harry tries the Expelliarmus charm to block Voldemort's attempted Killing Curse. The beams from their wands entwine and Voldemort's wand disgorges the last spells it performed. The spirits of the people he murdered are seen in the graveyard: Cedric, Frank Bryce, and Harry's parents. This distracts Voldemort and his Death Eaters, allowing Harry to use the Portkey to escape with Cedric's body.\nHarry tells Dumbledore that Voldemort returned and is responsible for Cedric's death. Moody takes Harry back to his office to interrogate him about Voldemort, inadvertently blowing his cover when he asks Harry about a graveyard, despite Harry not mentioning a graveyard. Moody reveals that he submitted Harry's name to the Goblet of Fire and manipulated everything to ensure he would win the tournament. Moody then attempts to kill Harry, but Dumbledore, Snape, and Minerva McGonagall subdue him. The teachers force Moody to drink Veritaserum, and he reveals that he is not actually Moody and that the real Moody is imprisoned in a magical trunk as his Polyjuice Potion wears off. The impostor Moody is revealed as Crouch Jr. and returned to Azkaban.\nDumbledore reveals to the students that Voldemort killed Cedric, although the Ministry of Magic opposes the revelation. Dumbledore later visits Harry in his dormitory, apologizing to him for the dangers he endured. Harry reveals that he saw his parents in the graveyard; Dumbledore names this effect as \"Priori Incantatem\". Hogwarts, Durmstrang, and Beauxbatons bid farewell to each other."
  },
  {
    "title": "Harry Potter Ep5",
    "subtitle": "Harry Potter and the Order of the Phoenix",
    "image_url": "https://sites.google.com/site/introharrypotter/_/rsrc/1467122401328/home/harry-potter-5/Harry502.jpg",
    "detail": "The Order of the Phoenix, a secret organization founded by Albus Dumbledore, informs Harry Potter that the Ministry of Magic is oblivious to Lord Voldemort's return. At the Order's headquarters, Harry's godfather, Sirius Black, mentions that Voldemort is after an object he did not have during his previous attack.\nBack at Hogwarts, Harry learns that the Minister for Magic Cornelius Fudge has appointed a new Defence Against the Dark Arts professor: Dolores Umbridge. She and Harry immediately clash, and she punishes Harry for his \"lies\" by forcing him to write a message with a magic quill, scarring his hand. When Ron and Hermione notice Harry's scars, they are outraged, but Harry refuses to go to Dumbledore, who has distanced himself from Harry since the summer. As Umbridge's control over the school increases, Ron and Hermione aid Harry in forming a secret group to train students in defensive spells, calling themselves \"Dumbledore's Army\". Umbridge recruits the Slytherin students to expose the group. Meanwhile, Harry and Cho Chang develop romantic feelings for each other.\nHarry has a vision involving an attack upon Arthur Weasley, from the point of view of Arthur's attacker. Concerned that Voldemort will exploit this connection to Harry, Dumbledore instructs Severus Snape to give Harry Occlumency lessons to defend his mind from Voldemort's influence. The connection between Harry and Voldemort leads Harry to further isolate himself from his friends. Meanwhile, Bellatrix Lestrange, Sirius' deranged Death Eater cousin, escapes from Azkaban along with nine other Death Eaters. At Hogwarts, Umbridge and her Inquisitorial Squad expose Dumbledore's Army. Dumbledore escapes as Fudge orders his arrest, and Umbridge becomes the new Headmistress. Harry's relationship with Cho falls apart, as he believes she betrayed Dumbledore's Army to Umbridge. Harry discovers through Snape's memories why Snape hated Harry's father James, who often ridiculed him.\nHarry has another vision, this one of Sirius being tortured by Voldemort. Harry, Ron and Hermione rush to Umbridge's fireplace to alert the Order via the Floo Network, since hers is the only fireplace not being monitored, but Umbridge stops them before they can do so. As Umbridge tortures Harry, Hermione tricks Umbridge into entering the Forbidden Forest in search of Dumbledore's \"secret weapon\". She and Harry lead her to the hiding place of Hagrid's giant half-brother, Grawp, only to be confronted by centaurs who kidnap Umbridge after she attacks and insults them. Harry, Hermione, Ron, Luna, Neville and Ginny fly to the Ministry of Magic on Thestrals in an attempt to save Sirius.\nThe six enter the Department of Mysteries where they uncover a bottled prophecy, the object Voldemort was after. However, they are ambushed by Death Eaters including Lucius Malfoy and Bellatrix Lestrange. Lucius reveals that Harry only saw a dream of Sirius being tortured; it was simply a ruse to lure Harry into the Death Eaters' grasp. Harry refuses to give Lucius the prophecy, and a fight between Dumbledore's Army and the Death Eaters ensues. The Death Eaters take everyone except Harry as hostages, threatening to kill them unless he surrenders the prophecy. Harry obliges just as Sirius and Remus Lupin arrive with Order members Nymphadora Tonks, Kingsley Shacklebolt and Mad-Eye Moody. As they attack the Death Eaters, Lucius drops the prophecy, destroying it. Just as Sirius overpowers Lucius, Bellatrix kills Sirius.\nVoldemort appears, but Dumbledore arrives through the Floo Network moments before Voldemort can kill Harry. A duel between Voldemort and Dumbledore ensues, destroying much of the Atrium, while Bellatrix escapes. After the two prove evenly matched, Voldemort possesses Harry to try to get Dumbledore to sacrifice Harry, but the love Harry feels for his friends and Sirius makes it impossible for Voldemort to remain in his body. Ministry officials arrive before Voldemort disapparates; Fudge is forced to admit that Voldemort has returned and resigns as Minister in disgrace. Umbridge is removed from Hogwarts and Dumbledore returns as headmaster. Dumbledore explains he distanced himself from Harry throughout the year hoping it would lessen the risk of Voldemort using their connection. Harry tries to come to terms with the prophecy; \"Neither can live while the other survives.\""
  },
  {
    "title": "Harry Potter Ep6",
    "subtitle": "Harry Potter and the Half-Blood Prince",
    "image_url": "https://i.pinimg.com/originals/d0/08/52/d0085257e2b7a4668a5496aec2c6ff04.jpg",
    "detail": "Lord Voldemort tightens his grip on the wizarding and Muggle worlds: his Death Eaters kidnap Garrick Ollivander, and destroy the Millennium Bridge. When Lucius Malfoy is sent to Azkaban, Voldemort chooses Draco to carry out a secret mission at Hogwarts. Draco's mother Narcissa and aunt Bellatrix Lestrange seek out Severus Snape, who claims to be a mole within the Order of the Phoenix. Snape makes an Unbreakable Vow with Narcissa to protect Draco and fulfil his assignment if he fails.\nHarry Potter accompanies Albus Dumbledore to persuade former Potions professor Horace Slughorn to return to Hogwarts. At the Burrow, Harry reunites with his best friends Ron Weasley and Hermione Granger. They visit Fred and George Weasley's new joke shop in Diagon Alley and see Draco enter Knockturn Alley with a group of Death Eaters, including Fenrir Greyback. Harry believes Voldemort has made Draco a Death Eater, but Ron and Hermione are sceptical. On the Hogwarts Express, Harry hides in the Slytherin carriage using his Invisibility Cloak in an attempt to gain information, but is spotted and petrified by Malfoy, before being saved by Luna Lovegood with her Spectrespecs.\nHarry discovers his borrowed Potions textbook is filled with helpful notes and spells left by the \"Half-Blood Prince\", and uses the book to excel in class and impress Slughorn, winning a Liquid Luck potion. Ron becomes Keeper of the Gryffindor Quidditch team and begins dating Lavender Brown, upsetting Hermione. Harry consoles Hermione, admitting to his own feelings for Ron's younger sister, Ginny. Harry spends the Christmas holidays with the Weasleys, where his suspicions about Draco are dismissed by the Order, but Arthur Weasley reveals that the Malfoys may have been interested in a Vanishing Cabinet. Bellatrix and Greyback attack the Burrow, and Harry saves Ginny before the Order arrives and fights off the Death Eaters.\nAt Hogwarts, Dumbledore asks Harry to retrieve a memory of a young Voldemort from Slughorn. After Ron accidentally ingests a love potion intended for Harry, Harry cures him with Slughorn's help. The trio celebrate with mead Slughorn intended to gift to Dumbledore, but Ron is poisoned, forcing Harry to save his life. Ron murmurs Hermione's name while recovering in the infirmary, causing Lavender to end their relationship. Harry confronts Draco about the poisoned mead and a cursed necklace that nearly killed another student, and they duel. Harry uses one of the Half-Blood Prince's curses to severely injure Malfoy, who is saved by Snape. Fearing the book contains more Dark Magic, Ginny and Harry hide it in the Room of Requirement and share their first kiss.\nHarry uses his Liquid Luck potion to convince Slughorn to surrender the memory Dumbledore needs. Viewing the memory with Dumbledore, Harry learns Voldemort wanted information about Horcruxes, magical objects containing pieces of a wizard's soul as a form of immortality. Dumbledore concludes that Voldemort divided his soul into six Horcruxes, two of which have been destroyed: Tom Riddle's diary and Marvolo Gaunt's ring. They travel to a cave where Harry aids Dumbledore in drinking a potion that hides another Horcrux, Slytherin's locket.\nA weakened Dumbledore defends them from Inferi and apparates back to Hogwarts, where Bellatrix, Greyback, and other Death Eaters enter through the Vanishing Cabinet in the Room of Requirement, which Draco connected to the one in Knockturn Alley. As Harry hides, Draco appears and disarms the headmaster, revealing he was chosen by Voldemort to kill Dumbledore, but he hesitates; Snape kills Dumbledore instead. As the Death Eaters escape, Snape reveals that he is the Half-Blood Prince.\nAs Hogwarts students and staff mourn Dumbledore's death, Harry reveals to Ron and Hermione that the locket was a fake, containing a message from \"R.A.B.\", who stole the real Horcrux to destroy. Harry, Ron, and Hermione decide to forgo their final year at Hogwarts in order to track down the remaining Horcruxes."
  },
  {
    "title": "Harry Potter Ep7",
    "subtitle": "Harry Potter and the Deathly Hallows",
    "image_url": "http://images6.fanpop.com/image/photos/33000000/Harry-Potter-h3rmioneg-33045824-1920-1200.jpg",
    "detail": "The Minister for Magic Rufus Scrimgeour addresses the wizarding media, stating that the Ministry remains strong despite Lord Voldemort gaining power and the Death Eaters committing mass killings of Muggles and infiltrating the Ministry. Meanwhile, Harry Potter, Ron Weasley, and Hermione Granger resolve to complete the mission Albus Dumbledore gave Harry by hunting down and destroying Voldemort's Horcruxes. Severus Snape informs Voldemort of Harry's impending departure from Privet Drive.\nThe Order of the Phoenix escort Harry to safety using Polyjuice Potion to create decoy Harrys. During their flight, they are ambushed by Death Eaters, who kill Mad-Eye Moody and Hedwig, and injure George Weasley. Arriving at The Burrow, Harry has a vision of the wand-maker Ollivander being tortured by Voldemort. The next day, Scrimgeour arrives with Dumbledore's will. Ron receives Dumbledore's Deluminator, Hermione receives a copy of The Tales of Beedle the Bard, and Harry receives the first Golden Snitch that he caught in a Quidditch match. Scrimgeour reveals that Harry was also bequeathed the Sword of Gryffindor, which has gone missing.\nThe Death Eaters kill Scrimgeour and replace him with Pius Thicknesse. The Ministry begins arresting and persecuting Muggle-born witches and wizards. Death Eaters also attack during Bill Weasley and Fleur Delacour's wedding. Kingsley Shacklebolt's patronus charm forewarns the wedding party and most escape. Harry, Hermione, and Ron disapparate to London, but are attacked in a diner by Death Eaters. The trio seeks refuge at Number 12, Grimmauld Place. They discover that the \"R.A.B.\" from the fake Horcrux locket is Regulus Arcturus Black, younger brother of Sirius Black. Kreacher, the Blacks' house-elf, tells them that Mundungus Fletcher broke in and stole the real locket. Kreacher and Dobby apprehend Fletcher, who reveals that Dolores Umbridge owns the locket. Using Polyjuice Potion, the trio infiltrate the Ministry and retrieve the locket from Umbridge. They lose their pursuers by apparating to the wilderness, but Ron is injured and cannot apparate again until he recovers.\nAfter unsuccessful attempts to destroy the Horcrux, the trio take turns wearing it to dilute its power. Harry sees a vision of Voldemort interrogating and killing the wand-maker Gregorovitch, who claims a teenage boy stole the legendary Elder Wand from his shop. While Ron is wearing the locket, he is overcome by negative feelings and falls out with Harry before abandoning him and Hermione. Hermione deduces that the Sword of Gryffindor can destroy Horcruxes and decides to go with Harry to Godric's Hollow. They visit Harry's parents' graves and the house where they were killed. They encounter Bathilda Bagshot, who they believe may have the sword. Bathilda lets them into her house before revealing herself as Nagini, possessing Bathilda's reanimated corpse. Hermione and Harry escape into the Forest of Dean, but Hermione accidentally breaks Harry's wand whilst fighting Nagini. She identifies the mysterious thief in Harry's vision as Gellert Grindelwald.\nHarry sees a Patronus in the form of a doe, which leads him to a frozen pond. Gryffindor's sword lies beneath the pond's ice, which Harry breaks and jumps into. The locket around his neck strangles Harry, but Ron arrives and rescues him. Harry speaks Parseltongue to open the Horcrux locket and Ron destroys it. Hermione and Ron reconcile, and the trio visits Xenophilius Lovegood to learn more about a symbol in the book Dumbledore left Hermione. Lovegood explains that the symbol represents the Deathly Hallows, three magical objects that can make a wizard master of Death. Hermione reads the story of the Hallows, after which the trio try to leave but they are stopped by Lovegood. He reveals that his daughter, Luna, has been kidnapped and then summons the Death Eaters, intending to hand over Harry in exchange for her. Harry, Ron, and Hermione disapparate as Lovegood's house is destroyed.\nBack in the wilderness, the trio set up camp when Snatchers find them. Hermione uses a curse to disguise Harry as the Snatchers take them to Malfoy Manor. Bellatrix Lestrange imprisons the disguised Harry and Ron in the cellar with Luna, Ollivander, and Griphook. Bellatrix tortures Hermione for information on the Sword, asking how they stole it from her vault at Gringotts. Harry requests help, communicating with a broken mirror in his possession. Dobby apparates into the cellar to save them. Harry and Ron rush to save Hermione, and a battle ensues that sees Harry disarm Draco Malfoy. Dobby drops a chandelier onto Bellatrix, forcing her to release Hermione. Bellatrix throws her knife at them as Dobby grabs everyone and disapparates. Although Harry, Ron, and Hermione arrive at Shell Cottage safely, they find that Bellatrix's knife has fatally wounded Dobby, and he dies in Harry's arms. Harry insists that they bury Dobby without any magic. Meanwhile, Voldemort breaks into Dumbledore's tomb and steals his wand."
  }
]
